pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_PC/LED_Boost_PC_Main.c
// System control
int16    StopAll=0;
int16    EnableAll=0;
int16    MergeLEDs=0;
int16    AutoColor=0;
int16    SetColor1=0;
int16    SetColor2=0;
int16    ChannelEnable1=1;          // Flag [ 0="off", 1="on" ]
int16    ChannelEnable2=1;          // Flag [ 0="off", 1="on" ]
int16    ChannelEnable3=1;          // Flag [ 0="off", 1="on" ]

long    Duty1=0;                    // Open-loop duty
long    Duty2=0;                    // Open-loop duty
long    Duty3=0;                    // Open-loop duty

int16    OCtrip=0;                  // Over-current protection trip flag
int16    OC_limit=4915;             // 0.160A in Q15

// Boost channel 1 2P2Z Control loop gains
long    Pgain1=50;                   //
long    Igain1=1;                    //
long    Dgain1=5;                    //
// Boost channel 2 2P2Z Control loop gains
long    Pgain2=50;                   //
long    Igain2=1;                    //
long    Dgain2=5;                    //
// Boost channel 3 2P2Z Control loop gains
long    Pgain3=50;                   //
long    Igain3=1;                    //
long    Dgain3=5;                    //

// Variables for background support only (no need to access)
int16    i=0;                    // common use incrementer
int16    temp_Scratch=0;         // Temp here means Temporary

// History arrays are used for Running Average calculation (boxcar filter)
// Used for CCS display and GUI only, not part of control loop processing
int16    HistPtr=0;                // Index for History arrays
long    Hist_Vin[HistorySize];
long    Hist_Vout1[HistorySize];
long    Hist_Vout2[HistorySize];
long    Hist_Vout3[HistorySize];
long    Hist_Vout8[HistorySize];
long    Hist_Iout1[HistorySize];
long    Hist_Iout2[HistorySize];
long    Hist_Iout3[HistorySize];


//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// VARIABLE DECLARATIONS - CCS WatchWindow / GUI support
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// -------------------------------- FRAMEWORK --------------------------------------

//GUI support variables
// sets a limit on the amount of external GUI controls - increase as necessary
int16     *varSetTxtList[7];                //16 textbox controlled variables
int16     *varSetBtnList[1];                //16 button controlled variables
int16     *varSetSldrList[8];            //16 slider controlled variables
int16     *varGetList[10];                //16 variables sendable to GUI
int16     *arrayGetList[1];                //16 arrays sendable to GUI

// ---------------------------------- USER -----------------------------------------

int16    FlashID=0x5055;

// Variables for easier "human" use
int16    Gui_Vin=0;      //Q09
int16    Gui_Vout1=0;    //Q08
int16    Gui_Vout2=0;    //Q08
int16    Gui_Vout3=0;    //Q08
int16    Gui_Vout8=0;    //Q08
int16    Gui_Iset1=0;    //Q15
int16    Gui_Iset2=0;    //Q15
int16    Gui_Iset3=0;    //Q15
int16    Gui_Iout1=0;    //Q15
int16    Gui_Iout2=0;    //Q15
int16    Gui_Iout3=0;    //Q15

//Scaling Constants (values found via spreadsheet; exact value calibrated per board)
int16    K_Vin=19439;    // 0.593 in Q15
int16    K_Vout=20452;   // 0.625 in Q15
int16    iK_Iset=24824;  // 1.515 in Q14
int16    K_Iout=21627;   // 0.660 in Q15


//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// MAIN CODE - starts here
//%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

void main(void)
{
//=================================================================================
//    INITIALISATION - General
//=================================================================================

//-------------------------------- FRAMEWORK --------------------------------------

    DeviceInit();    // Device Life support & GPIO
    SCIA_Init();      // Initalize the Serial Comms A peripheral

// Only used if running from FLASH
// Note that the variable FLASH is defined by the build configuration
#ifdef FLASH
    // Copy time critical code and Flash setup code to RAM
    // The  RamfuncsLoadStart, RamfuncsLoadSize, and RamfuncsRunStart
    // symbols are created by the linker. Refer to the linker files.
    memcpy(&RamfuncsRunStart, &RamfuncsLoadStart, (size_t)&RamfuncsLoadSize);

    // Call Flash Initialization to setup flash waitstates
    // This function must reside in RAM
    InitFlash();    // Call the flash wrapper init function
#endif //(FLASH)

    // Timing sync for background loops
    // Timer period definitions found in device specific F2802x_device.h
    CpuTimer0Regs.PRD.all =  mSec1;         // A tasks
    CpuTimer1Regs.PRD.all =  mSec10;        // B tasks
    CpuTimer2Regs.PRD.all =  mSec50;        // C tasks

    // Tasks State-machine init
    Alpha_State_Ptr = &A0;
    A_Task_Ptr = &A1;
    B_Task_Ptr = &B1;
    C_Task_Ptr = &C1;

// ---------------------------------- USER -----------------------------------------

// 2 pole / 2 Zero compensator coefficients (B2, B1, B0, A2, A1) are mapped to the
// simpler 3 coefficients P, I, D  to allow for trial & error intuitive tuning via
// CCS WatchWindow or GUI Sliders.  Note: User can modify if needed and assign full
// set of 5 coef.

    // Boost channel 1 2P2Z Coefficient init
    CNTL_2P2Z_CoefStruct1.b2 = _IQ16(Dgain1);
    CNTL_2P2Z_CoefStruct1.b1 = _IQ16(Igain1 - Pgain1 - Dgain1 - Dgain1);
    CNTL_2P2Z_CoefStruct1.b0 = _IQ16(Pgain1 + Igain1 + Dgain1);
    CNTL_2P2Z_CoefStruct1.a2 = _IQ26(0.0);
    CNTL_2P2Z_CoefStruct1.a1 = _IQ26(1.0);
    CNTL_2P2Z_CoefStruct1.max = _IQ14(DMAX);
    CNTL_2P2Z_CoefStruct1.min = _IQ14(DMIN);

    // Boost channel 2 2P2Z Coefficient init
    CNTL_2P2Z_CoefStruct2.b2 = _IQ16(Dgain2);
    CNTL_2P2Z_CoefStruct2.b1 = _IQ16(Igain2 - Pgain2 - Dgain2 - Dgain2);
    CNTL_2P2Z_CoefStruct2.b0 = _IQ16(Pgain2 + Igain2 + Dgain2);
    CNTL_2P2Z_CoefStruct2.a2 = _IQ26(0.0);
    CNTL_2P2Z_CoefStruct2.a1 = _IQ26(1.0);
    CNTL_2P2Z_CoefStruct2.max = _IQ14(DMAX);
    CNTL_2P2Z_CoefStruct2.min = _IQ14(DMIN);

    // Boost channel 3 2P2Z Coefficient init
    CNTL_2P2Z_CoefStruct3.b2 = _IQ16(Dgain3);
    CNTL_2P2Z_CoefStruct3.b1 = _IQ16(Igain3 - Pgain3 - Dgain3 - Dgain3);
    CNTL_2P2Z_CoefStruct3.b0 = _IQ16(Pgain3 + Igain3 + Dgain3);
    CNTL_2P2Z_CoefStruct3.a2 = _IQ26(0.0);
    CNTL_2P2Z_CoefStruct3.a1 = _IQ26(1.0);
    CNTL_2P2Z_CoefStruct3.max = _IQ14(DMAX);
    CNTL_2P2Z_CoefStruct3.min = _IQ14(DMIN);


    for(i=0; i<HistorySize; i++)
        Hist_Iout1[i] = 0;    //Q12 * 8 = Q15
    for(i=0; i<HistorySize; i++)
        Hist_Iout2[i] = 0;    //Q12 * 8 = Q15
    for(i=0; i<HistorySize; i++)
        Hist_Iout3[i] = 0;    //Q12 * 8 = Q15


