pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_PC/LED_Boost_PC_Main.c
//=================================================================================
//    INITIALISATION - GUI connections
//=================================================================================
// Use this section only if you plan to "Instrument" your application using the 
// Microsoft C# freeware GUI Template provided by TI

    varSetTxtList[0] = &MergeLEDs;
    varSetTxtList[1] = &SlewStepAll;
    varSetTxtList[2] = &AutoColor;
    varSetTxtList[3] = &SetColor1;
	varSetTxtList[4] = 0;
    varSetTxtList[5] = &StopAll;
    varSetTxtList[6] = &EnableAll;

    varSetSldrList[0] = &Gui_Iset1;
    varSetSldrList[1] = &Gui_Iset2;
    varSetSldrList[2] = &Gui_Iset3;
	varSetSldrList[3] = 0;
	varSetSldrList[4] = 0;
	varSetSldrList[5] = 0;
	varSetSldrList[6] = 0;
	varSetSldrList[7] = 0;

    varGetList[0] = &FlashID;
    varGetList[1] = &Gui_Vin;
    varGetList[2] = &Gui_Iout1;
    varGetList[3] = &Gui_Iout2;
    varGetList[4] = &Gui_Iout3;
	varGetList[5] = 0;
	varGetList[6] = 0;
	varGetList[7] = 0;
	varGetList[8] = 0;
	varGetList[9] = 0;


//==================================================================================
//    INITIALISATION - Peripherals used for support
//==================================================================================

//==================================================================================
//    INCREMENTAL BUILD OPTIONS - NOTE: select via ProjectSettings.h
//==================================================================================

// ---------------------------------- USER -----------------------------------------
#define        prd            1200    // 1200 Period count = 50 KHz @ 60 MHz
//#define        prd            600    // 600 Period count = 100 KHz @ 60 MHz
//#define        prd            300    // 300 Period count = 200 KHz @ 60 MHz
//#define        prd            200    // 200 Period count = 300 KHz @ 60 MHz
//#define        prd            150    // 150 Period count = 400 KHz @ 60 MHz

#define        Iout1R    AdcResult.ADCRESULT1        //Q12
#define        Iout2R    AdcResult.ADCRESULT2        //Q12
#define        Iout3R    AdcResult.ADCRESULT3        //Q12
#define        Vout1R    AdcResult.ADCRESULT9        //Q12
#define        Vout2R    AdcResult.ADCRESULT10       //Q12
#define        Vout3R    AdcResult.ADCRESULT11       //Q12
#define        VinR      AdcResult.ADCRESULT12       //Q12

    // ADC Channel Selection
    ChSel[0] = 2;        // Dummy read for first sample bug
    ChSel[1] = 2;        // A2 - Iout1 - blue
    ChSel[2] = 1;        // A1 - Iout2 - green
    ChSel[3] = 6;        // A6 - Iout3 - red
    ChSel[9] = 9;        // B1 - Vout1
    ChSel[10] = 10;      // B2 - Vout2
    ChSel[11] = 12;      // B3 - Vout3
    ChSel[12] = 14;      // B6 - Vin / Vout8

    // ADC Trigger Selection
    TrigSel[0] = 5;        // ePWM1, ADCSOCA
    TrigSel[1] = 5;        // ePWM1, ADCSOCA
    TrigSel[2] = 5;        // ePWM1, ADCSOCA
    TrigSel[3] = 5;        // ePWM1, ADCSOCA
    TrigSel[9] = 5;        // ePWM1, ADCSOCA
    TrigSel[10] = 5;       // ePWM1, ADCSOCA
    TrigSel[11] = 5;       // ePWM1, ADCSOCA
    TrigSel[12] = 5;       // ePWM1, ADCSOCA

    ADC_SOC_CNF(ChSel, TrigSel, ACQPS, 16, 0);
    PWM_DualUpDwnCnt_CNF(1, prd, 1, 0);
    PWM_DualUpDwnCnt_CNF(2, prd, 0, 400);
    PWM_1ch_UpDwnCnt_CNF(3, prd, 0, 400);

    // Configure ePWMs to generate ADC SOC pulses
    EPwm1Regs.ETSEL.bit.SOCAEN = 1;                // Enable ePWM1 SOCA pulse
    EPwm1Regs.ETSEL.bit.SOCASEL = ET_CTR_PRD;      // SOCA from ePWM1 Zero event
    EPwm1Regs.ETPS.bit.SOCAPRD = ET_3RD;           // Trigger ePWM1 SOCA on every 3rd event

    DPL_Init();                                    // DPL ASM ISR init

//----------------------------------------------------------------------
#if (INCR_BUILD == 1)     // Open-Loop
//----------------------------------------------------------------------

// Lib Module connection to "nets" 
//----------------------------------------

    // Boost 1 connections
    ADCDRV_1ch_Rlt1 = &AdcNetBus[1];
    PWMDRV_DualUpDwnCnt_Duty1A = &Duty1;
    // Boost 2 connections
    ADCDRV_1ch_Rlt2 = &AdcNetBus[2];
    PWMDRV_DualUpDwnCnt_Duty1B = &Duty2;
    // Boost 3 connections
    ADCDRV_1ch_Rlt3 = &AdcNetBus[3];
    PWMDRV_1ch_UpDwnCnt_Duty2 = &Duty3;
    // Voltage connections
    ADCDRV_1ch_Rlt9 = &AdcNetBus[9];
    ADCDRV_1ch_Rlt10 = &AdcNetBus[10];
    ADCDRV_1ch_Rlt11 = &AdcNetBus[11];
    ADCDRV_1ch_Rlt12 = &AdcNetBus[12];
#endif // (INCR_BUILD == 1)


//----------------------------------------------------------------------
#if (INCR_BUILD == 2) // Closed-Loop Current
//----------------------------------------------------------------------

// Lib Module connection to "nets" 
//----------------------------------------

    // Boost 1 connections
    ADCDRV_1ch_Rlt1 = &AdcNetBus[1];
    CNTL_2P2Z_Ref1 = &IrefNetBus1;                // point to Iref1
    CNTL_2P2Z_Fdbk1 = &AdcNetBus[1];              // point to Iout1
    CNTL_2P2Z_Coef1 = &CNTL_2P2Z_CoefStruct1.b2;  // point to first coeff of 1st loop
    CNTL_2P2Z_Out1 = &UoutNetBus1;                // point to 2P2Z Uout1
    PWMDRV_DualUpDwnCnt_Duty1A = &UoutNetBus1;

    // Boost 2 connections
    ADCDRV_1ch_Rlt2 = &AdcNetBus[2];
    CNTL_2P2Z_Ref2 = &IrefNetBus2;                // point to Iref2
    CNTL_2P2Z_Fdbk2 = &AdcNetBus[2];              // point to Iout2
    CNTL_2P2Z_Coef2 = &CNTL_2P2Z_CoefStruct2.b2;  // point to first coeff of 1st loop
    CNTL_2P2Z_Out2 = &UoutNetBus2;                // point to 2P2Z Uout2
    PWMDRV_DualUpDwnCnt_Duty1B = &UoutNetBus2;

    // Boost 3 connections
    ADCDRV_1ch_Rlt3 = &AdcNetBus[3];
    CNTL_2P2Z_Ref3 = &IrefNetBus3;                // point to Iref3
    CNTL_2P2Z_Fdbk3 = &AdcNetBus[3];              // point to Iout3
    CNTL_2P2Z_Coef3 = &CNTL_2P2Z_CoefStruct3.b2;  // point to first coeff of 1st loop
    CNTL_2P2Z_Out3 = &UoutNetBus3;                // point to 2P2Z Uout3
    PWMDRV_1ch_UpDwnCnt_Duty2 = &UoutNetBus3;

