pkahlert/EPE-MES/02_Software/01_c2000/C2000_LaunchPad/f2802x_examples/LED_Boost_PC/LED_Boost_PC_Main.c
}

//=================================================================================
//    B - TASKS
//=================================================================================

//----------------------------------- USER ----------------------------------------
//----------------------------------------------------
void B1(void) // Current Dashboard measurements
//----------------------------------------------------
{
// Measurement code expandable to multiple channels, defined by "NumChannels"
// Voltage measurement calculated by:
//    Gui_Vout = VoutAvg * K_Vout, where VoutAvg = sum of 8 VoutR samples
//
    HistPtr++;
    if (HistPtr >= HistorySize)    HistPtr = 0;

    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //----------------------------------------------------------------
    Hist_Iout1[HistPtr] = Iout1R;
    Hist_Iout2[HistPtr] = Iout2R;
    Hist_Iout3[HistPtr] = Iout3R;
    Hist_Vout1[HistPtr] = Vout1R;
    Hist_Vout2[HistPtr] = Vout2R;
    Hist_Vout3[HistPtr] = Vout3R;
    Hist_Vin[HistPtr] = VinR;

    // Current Measurement
    //----------------------------------------------------------------
    // view following variables in Watch Window as:
    //        Gui_Vout = Q10

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Iout1[i];    //Q12 * 8 = Q15
    Gui_Iout1 = ((long)temp_Scratch*(long)K_Iout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Iout2[i];    //Q12 * 8 = Q15
    Gui_Iout2 = ((long)temp_Scratch*(long)K_Iout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Iout3[i];    //Q12 * 8 = Q15
    Gui_Iout3 = ((long)temp_Scratch*(long)K_Iout) >> 15;    //Q15*Q15 >> 15 = Q15

    //-----------------
    B_Task_Ptr = &B2;    
    //-----------------
}

//----------------------------------------------------
void B2(void) // Voltage Dashboard measurements
//----------------------------------------------------
{
// Measurement code expandable to multiple channels, defined by "NumChannels"
// Voltage measurement calculated by:
//    Gui_Vout = VoutAvg * K_Vout, where VoutAvg = sum of 8 VoutR samples

    HistPtr++;
    if (HistPtr >= HistorySize)    HistPtr = 0;

    // BoxCar Averages - Input Raw samples into BoxCar arrays
    //----------------------------------------------------------------
    Hist_Iout1[HistPtr] = Iout1R;
    Hist_Iout2[HistPtr] = Iout2R;
    Hist_Iout3[HistPtr] = Iout3R;
    Hist_Vout1[HistPtr] = Vout1R;
    Hist_Vout2[HistPtr] = Vout2R;
    Hist_Vout3[HistPtr] = Vout3R;
    Hist_Vin[HistPtr] = VinR;

    // Voltage Measurement
    //----------------------------------------------------------------
    // view following variables in Watch Window as:
    //        Gui_Vout = Q10
    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vout1[i];    //Q12 * 8 = Q15
    Gui_Vout1 = ((long)temp_Scratch*(long)K_Vout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vout2[i];    //Q12 * 8 = Q15
    Gui_Vout2 = ((long)temp_Scratch*(long)K_Vout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vout3[i];    //Q12 * 8 = Q15
    Gui_Vout3 = ((long)temp_Scratch*(long)K_Vout) >> 15;    //Q15*Q15 >> 15 = Q15

    temp_Scratch=0;
    for(i=0; i<HistorySize; i++)
        temp_Scratch = temp_Scratch + Hist_Vin[i];    //Q12 * 8 = Q15
    Gui_Vin = ((long)temp_Scratch*(long)K_Vin) >> 15;    //Q15*Q15 >> 15 = Q15

    //-----------------
    B_Task_Ptr = &B1;    
    //-----------------
}
//=================================================================================
//    C - TASKS
//=================================================================================

//----------------------------- USER ----------------------------------------------

//----------------------------------------
void C1(void) //  Blinking LED control
//----------------------------------------
{

    //-----------------
    C_Task_Ptr = &C2;    
    //-----------------
}

//----------------------------------------
void C2(void) //  Automatic color control, Manual color control
//----------------------------------------
{
    #define AutoColorMIN 253670
    
    if (AutoColor)
    {
		SlewStep1 = 3*60;
		SlewStep2 = 1*60;
		SlewStep3 = 5*60;
		
		if (IrefNetBus1 <= AutoColorMIN)
			Gui_Iset1 = 0.03*32768;
		else if (IrefNetBus1 == Itarget1)
			Gui_Iset1 = 0.01*32768;
		if (IrefNetBus2 <= AutoColorMIN)
			Gui_Iset2 = 0.05*32768;
		else if (IrefNetBus2 == Itarget2)
			Gui_Iset2 = 0.01*32768;
		if (IrefNetBus3 <= AutoColorMIN)
			Gui_Iset3 = 0.06*32768;
		else if (IrefNetBus3 == Itarget3)
			Gui_Iset3 = 0.01*32768;

		ResetSlew = 1;
    }
    else
    {
        if (ResetSlew == 1)
        {
            SlewStep1 = SlewStepAll;
            SlewStep2 = SlewStepAll;
            SlewStep3 = SlewStepAll;
            ResetSlew = 0;
        }    
    }

    if (!AutoColor)
    {    
        switch(SetColor1)
        {
            case 0:
                break;
            case 99:    // Off
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;
            case 1:        // Red
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0.03*32768;
                break;
            case 2:        // Orange
                Gui_Iset1 = 0;
                Gui_Iset2 = 0.01*32768;
                Gui_Iset3 = 0.035*32768;
                break;
            case 3:        // Yellow
                Gui_Iset1 = 0;;
                Gui_Iset2 = 0.025*32768;
                Gui_Iset3 = 0.035*32768;
                break;
            case 4:        // Green
                Gui_Iset1 = 0;
                Gui_Iset2 = 0.03*32768;
                Gui_Iset3 = 0;
                break;
            case 5:        // Blue
                Gui_Iset1 = 0.03*32768;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;
            case 6:        // Purple
                Gui_Iset1 = 0.025*32768;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0.025*32768;
                break;
            case 7:        // White
                Gui_Iset1 = 0.015*32768;
                Gui_Iset2 = 0.02*32768;
                Gui_Iset3 = 0.025*32768;
                break;
            case 8:           // Black
                Gui_Iset1 = 0;
                Gui_Iset2 = 0;
                Gui_Iset3 = 0;
                break;

            default:
                break;
        } // SetColor1
        SetColor1 = 0;

    } // !AutoColor

    //-----------------
    C_Task_Ptr = &C1;    
    //-----------------
}


